Repository: gokulnathg14/fabric-docs-ml
Catalog: docs/source/locale/*/LC_MESSAGES/CONTRIBUTING.po
Languages: ml

source: We welcome contributions to Hyperledger in many forms, and there's always plenty to do!
ml: ഹൈപ്പർലെഡ്ജറിലേക്കുള്ള സംഭാവനകളെ ഞങ്ങൾ പല രൂപത്തിൽ സ്വാഗതം ചെയ്യുന്നു എല്ലായ്‌പ്പോഴും ധാരാളം കാര്യങ്ങൾ ചെയ്യാനുണ്ട്

source: First things first, please review the Hyperledger `Code of Conduct <https://wiki.hyperledger.org/community/hyperledger-project-code-of-conduct>`__ before participating. It is important that we keep things civil.
ml: ആദ്യം കാര്യങ്ങൾ ആദ്യം, ഹൈപ്പർലെഡ്ജർ പെരുമാറ്റച്ചട്ടം അവലോകനം ചെയ്യുക<https://wiki.hyperledger.org/community/hyperledger-project-code-of-conduct>`__പങ്കെടുക്കുന്നതിന് മുമ്പ്. നമ്മൾ കാര്യങ്ങൾ സൂക്ഷിക്കേണ്ടത് പ്രധാനമാണ്സിവിൽ.

source: Ways to contribute
ml: സംഭാവന ചെയ്യാനുള്ള വഴികൾ

source: There are many ways you can contribute to Hyperledger Fabric, both as a user and as a developer.
ml: ഹൈപ്പർലെഡ്ജർ ഫാബ്രിക്കിലേക്ക് നിങ്ങൾക്ക് സംഭാവന ചെയ്യാൻ നിരവധി മാർഗങ്ങളുണ്ട്, ഇവ രണ്ടും ഉപയോക്താവായും ഒരു ഡവലപ്പർ എന്ന നിലയിലും.

source: As a user:
ml: ഒരു ഉപയോക്താവെന്ന നിലയിൽ:

source: `Making Feature/Enhancement Proposals`_
ml: `സവിശേഷത / മെച്ചപ്പെടുത്തൽ നിർദ്ദേശങ്ങൾ ഉണ്ടാക്കുന്നു`_

source: `Reporting bugs`_
ml: `ബഗുകൾ റിപ്പോർട്ടുചെയ്യുന്നു`_

source: Help test an upcoming Epic on the `release roadmap <https://jira.hyperledger.org/secure/Dashboard.jspa?selectPageId=10104>`_. Contact the Epic assignee via the Jira work item or on `RocketChat <https://chat.hyperledger.org>`_.
ml: റിലീസ് റോഡ്മാപ്പിൽ വരാനിരിക്കുന്ന ഒരു എപിക് പരീക്ഷിക്കാൻ സഹായിക്കുക<https://jira.hyperledger.org/secure/Dashboard.jspa?selectPageId=10104>`_.ജിറ വർക്ക് ഇനം വഴിയോ `റോക്കറ്റ് ചാറ്റ് 'വഴിയോ എപ്പിക് അസൈനിയുമായി ബന്ധപ്പെടുക<https://chat.hyperledger.org>`_.

source: As a developer:
ml: ഒരു ഡവലപ്പർ എന്ന നിലയിൽ:

source: If you only have a little time, consider picking up a `"help-wanted" <https://jira.hyperledger.org/issues/?filter=10147>`_ task, see `Fixing issues and working stories`_.
ml: നിങ്ങൾക്ക് കുറച്ച് സമയമേയുള്ളൂവെങ്കിൽ,`"help-wanted" എടുക്കുന്നത് പരിഗണിക്കുകപ്രശ്നങ്ങളും പ്രവർത്തന കഥകളും`_.

source: If you can commit to full-time development, either propose a new feature (see `Making Feature/Enhancement Proposals`_) and bring a team to implement it, or join one of the teams working on an existing Epic. If you see an Epic that interests you on the `release roadmap <https://jira.hyperledger.org/secure/Dashboard.jspa?selectPageId=10104>`_, contact the Epic assignee via the Jira work item or on `RocketChat <https://chat.hyperledger.org/>`_.
ml: നിങ്ങൾക്ക് മുഴുവൻ സമയ വികസനത്തിന് പ്രതിജ്ഞാബദ്ധമാണെങ്കിൽ, ഒന്നുകിൽ ഒരു പുതിയ സവിശേഷത നിർദ്ദേശിക്കുകഇത് നടപ്പിലാക്കുക, അല്ലെങ്കിൽ നിലവിലുള്ള ഇതിഹാസത്തിൽ പ്രവർത്തിക്കുന്ന ടീമുകളിലൊന്നിൽ ചേരുക`റിലീസ് റോഡ്മാപ്പിൽ നിങ്ങൾക്ക് താൽപ്പര്യമുള്ള ഒരു എപിക് നിങ്ങൾ കാണുകയാണെങ്കിൽ<https://jira.hyperledger.org/secure/Dashboard.jspa?selectPageId=10104>`_,ജിറ വർക്ക് ഇനം വഴിയോ `റോക്കറ്റ് ചാറ്റ്' വഴിയോ എപ്പിക് അസൈനിയുമായി ബന്ധപ്പെടുക<https://chat.hyperledger.org/>`_.

source: Getting a Linux Foundation account
ml: ഒരു ലിനക്സ് ഫൌണ്ടേഷൻ അക്കൗണ്ട് ലഭിക്കുന്നതിന്

source: In order to participate in the development of the Hyperledger Fabric project, you will need a Linux Foundation account. Once you have a LF ID you will be able to access all the Hyperledger community tools, including `Jira issue management <https://jira.hyperledger.org>`__, `RocketChat <https://chat.hyperledger.org/>`__, and the `Wiki <https://wiki.hyperledger.org/display/fabric/Hyperledger+Fabric>`__ (for editing, only).
ml: ഹൈപ്പർലെഡ്ജർ ഫാബ്രിക്കിന്റെ പ്രോജക്റ്റ് വികസനത്തിൽ പങ്കെടുക്കുന്നതിന്നിങ്ങൾക്ക് ഒരു ലിനക്സ് ഫൌണ്ടേഷൻ അക്കൗണ്ട് ആവശ്യമാണ്. നിങ്ങൾക്ക് ഒരു എൽഎഫ് ഐഡി ലഭിച്ചുകഴിഞ്ഞാൽനിങ്ങൾക്ക് എല്ലാ ഹൈപ്പർലെഡ്ജർ കമ്മ്യൂണിറ്റി ഉപകരണങ്ങളും ആക്സസ് ചെയ്യാൻ കഴിയും `Jira issue management <https://jira.hyperledger.org>`__, `RocketChat<https://chat.hyperledger.org/>`__, and the `Wiki <https://wiki.hyperledger.org/display/fabric/Hyperledger+Fabric>`__ (forediting, only).

source: Follow the steps below to create a Linux Foundation account if you don't already have one.
ml: നിങ്ങൾക്ക് ഇതിനകം ഒരു ലിനക്സ് ഫൌണ്ടേഷൻ അക്കൗണ്ട് ഇല്ലെങ്കിൽ ചുവടെയുള്ളഘട്ടങ്ങൾ പാലിക്കുക.

source: Go to the `Linux Foundation ID website <https://identity.linuxfoundation.org/>`__.
ml: `ലിനക്സ് ഫൌണ്ടേഷൻ ഐഡി വെബ്‌സൈറ്റിലേക്ക് പോകുക<https://identity.linuxfoundation.org/>`__.

source: Select the option ``I need to create a Linux Foundation ID``, and fill out the form that appears.
ml: ``I need to create a Linux Foundation ID`` ഓപ്ഷൻ തിരഞ്ഞെടുത്ത് ദൃശ്യമാകുന്ന ഫോം പൂരിപ്പിക്കുക.

source: Wait a few minutes, then look for an email message with the subject line: "Validate your Linux Foundation ID email".
ml: കുറച്ച് മിനിറ്റ് കാത്തിരിക്കുക, തുടർന്ന് വിഷയ ലൈനിനൊപ്പം ഒരു ഇമെയിൽ സന്ദേശത്തിനായി തിരയുക: "Validate your Linux Foundation ID email".

source: Open the received URL to validate your email address.
ml: നിങ്ങളുടെ ഇമെയിൽ വിലാസം സാധൂകരിക്കാൻ ലഭിച്ച URL തുറക്കുക.

source: Verify that your browser displays the message ``You have successfully validated your e-mail address``.
ml: നിങ്ങളുടെ ബ്രൌസർ സന്ദേശം പ്രദർശിപ്പിക്കുന്നുണ്ടോയെന്ന് പരിശോധിക്കുക``You have successfully validated your e-mail address``.

source: Access `Jira issue management <https://jira.hyperledger.org>`__, or `RocketChat <https://chat.hyperledger.org/>`__.
ml: പരിശോധിക്കുക `Jira issue management <https://jira.hyperledger.org>`__, or `RocketChat <https://chat.hyperledger.org/>`__.

source: Project Governance
ml: പ്രോജക്ട് ഭരണം

source: Hyperledger Fabric is managed under an open governance model as described in our `charter <https://www.hyperledger.org/about/charter>`__. Projects and sub-projects are lead by a set of maintainers. New sub-projects can designate an initial set of maintainers that will be approved by the top-level project's existing maintainers when the project is first approved.
ml: വിവരിച്ചതുപോലെ ഓപ്പൺ ഗവേണൻസ് മോഡലിന് കീഴിലാണ് ഹൈപ്പർലെഡ്ജർ ഫാബ്രിക് നിയന്ത്രിക്കുന്നത് ഞങ്ങളുടെ` ചാർട്ടറിൽ <https://www.hyperledger.org/about/charter> `__. പ്രോജക്റ്റുകൾഉപ പ്രോജക്ടുകൾ ഒരു കൂട്ടം പരിപാലകർ നയിക്കുന്നു. പുതിയ ഉപ പ്രോജക്ടുകൾക്ക് കഴിയുംപ്രോജക്റ്റ് ആദ്യം അംഗീകരിക്കപ്പെടുമ്പോൾ ഉയർന്ന തലത്തിലുള്ള പ്രോജക്റ്റിന്റെ നിലവിലുള്ള പരിപാലകർ അംഗീകരിക്കുന്ന ഒരു പ്രാരംഭ പരിപാലകരെ നിയോഗിക്കുക.

source: Maintainers
ml: പരിപാലകർ

source: The Fabric project is lead by the project's top level `maintainers <https://github.com/hyperledger/fabric/blob/master/MAINTAINERS.md>`__. The maintainers are responsible for reviewing and merging all patches submitted for review, and they guide the overall technical direction of the project within the guidelines established by the Hyperledger Technical Steering Committee (TSC).
ml: ഫാബ്രിക് പ്രോജക്റ്റിന് നേതൃത്വം നൽകുന്നത് പ്രോജക്ടിന്റെ ഉയർന്ന തലത്തിലുള്ള `പരിപാലകർ '<https://github.com/hyperledger/fabric/blob/master/MAINTAINERS.md>` __. എല്ലാ പാച്ചുകളും അവലോകനം ചെയ്യാനും ലയിപ്പിക്കാനും പരിപാലകർക്ക് ഉത്തരവാദിത്തമുണ്ട്അവലോകനത്തിനായി സമർപ്പിച്ചു, കൂടാതെ ഹൈപ്പർലെഡ്ജർ ടെക്നിക്കൽ സ്റ്റിയറിംഗ് കമ്മിറ്റി (ടിഎസ്‌സി) സ്ഥാപിച്ച മാർഗ്ഗനിർദ്ദേശങ്ങൾക്കകത്ത് പദ്ധതിയുടെ മൊത്തത്തിലുള്ള സാങ്കേതിക ദിശയെ അവർ നയിക്കുന്നു.

source: Becoming a maintainer
ml: ഒരു പരിപാലകനാകുന്നതിന്

source: The project's maintainers will, from time-to-time, consider adding or removing a maintainer. An existing maintainer can submit a change set to the `maintainers <https://github.com/hyperledger/fabric/blob/master/MAINTAINERS.md>`__ file. A nominated Contributor may become a Maintainer by a majority approval of the proposal by the existing Maintainers. Once approved, the change set is then merged and the individual is added to (or alternatively, removed from) the maintainers group. Maintainers may be removed by explicit resignation, for prolonged inactivity (3 or more months), or for some infraction of the `code of conduct <https://wiki.hyperledger.org/community/hyperledger-project-code-of-conduct>`__ or by consistently demonstrating poor judgement. A maintainer removed for inactivity should be restored following a sustained resumption of contributions and reviews (a month or more) demonstrating a renewed commitment to the project.
ml: പ്രോജക്റ്റിന്റെ പരിപാലകർ, കാലാകാലങ്ങളിൽ, ഒരു പരിപാലകനെ ചേർക്കുന്നത് അല്ലെങ്കിൽ നീക്കംചെയ്യുന്നത് പരിഗണിക്കും. നിലവിലുള്ള ഒരു പരിപാലകന് ഒരു മാറ്റം സജ്ജമാക്കാം<https://github.com/hyperledger/fabric/blob/master/MAINTAINERS.md>` __ നിലവിലുള്ള പരിപാലകരുടെ നിർദ്ദേശത്തിന്റെ ഭൂരിപക്ഷ അംഗീകാരത്തോടെ നാമനിർദ്ദേശം ചെയ്യപ്പെട്ട ഒരു സംഭാവകന് ഒരു പരിപാലകനാകാം. അംഗീകാരം ലഭിച്ചുകഴിഞ്ഞാൽ, മാറ്റ സെറ്റ് ലയിപ്പിക്കുകയും വ്യക്തിയെ പരിപാലകരുടെ ഗ്രൂപ്പിലേക്ക് ചേർക്കുകയും ചെയ്യുന്നു (അല്ലെങ്കിൽ പകരം). വ്യക്തമായ രാജി, നീണ്ട നിഷ്‌ക്രിയത്വം (3 അല്ലെങ്കിൽ കൂടുതൽ മാസം) അല്ലെങ്കിൽ `പെരുമാറ്റച്ചട്ടത്തിന്റെ <https://wiki.hyperledger.org/community/hyperledger-project-code-of-conduct>`_ചില ലംഘനങ്ങൾ അല്ലെങ്കിൽ നിരന്തരം മോശം വിധി പ്രസ്താവിക്കുന്നതിലൂടെ, എന്നിവയിലൂടെ പരിപാലകരെ നീക്കംചെയ്യാം. നിഷ്‌ക്രിയത്വത്തിനായി നീക്കംചെയ്‌ത ഒരു പരിപാലകനെ തുടർച്ചയായി സംഭാവനകളും അവലോകനങ്ങളും (ഒരു മാസമോ അതിൽ കൂടുതലോ) പുനരാരംഭിച്ചതിന് ശേഷം പുന സ്ഥാപിക്കണം.

source: Release cadence
ml: കേഡൻസ് റിലീസ് ചെയ്യുക

source: The Fabric maintainers have settled on a quarterly (approximately) release cadence (see `releases <https://github.com/hyperledger/fabric#releases>`__). At any given time, there will be a stable LTS (long term support) release branch, as well as the master branch for upcoming new features. Follow the discussion on the #fabric-release channel in RocketChat.
ml: ഫാബ്രിക് പരിപാലകർ ത്രൈമാസ (ഏകദേശം) റിലീസ് കേഡൻസിൽ സ്ഥിരതാമസമാക്കി (`റിലീസുകൾകാണുക <https://github.com/hyperledger/fabric#releases>` __). ഏത് സമയത്തും, സ്ഥിരതയുള്ള എൽ‌ടി‌എസ് (ദീർഘകാല പിന്തുണ) റിലീസ് ബ്രാഞ്ചും വരാനിരിക്കുന്ന പുതിയ സവിശേഷതകൾക്കായുള്ള മാസ്റ്റർ ബ്രാഞ്ചും ഉണ്ടാകും. റോക്കറ്റ്ചാറ്റിലെ # ഫാബ്രിക്-റിലീസ് ചാനലിലെ ചർച്ച പിന്തുടരുക.

source: Making Feature/Enhancement Proposals
ml: സവിശേഷത / മെച്ചപ്പെടുത്തൽ നിർദ്ദേശങ്ങൾ നിർമ്മിക്കുന്നതിന്

source: First, take time to review `JIRA <https://jira.hyperledger.org/issues/?filter=12524>`__ to be sure that there isn't already an open (or recently closed) proposal for the same function. If there isn't, to make a proposal we recommend that you open a JIRA Epic or Story, whichever seems to best fit the circumstance and link or inline a "one pager" of the proposal that states what the feature would do and, if possible, how it might be implemented. It would help also to make a case for why the feature should be added, such as identifying specific use case(s) for which the feature is needed and a case for what the benefit would be should the feature be implemented. Once the JIRA issue is created, and the "one pager" either attached, inlined in the description field, or a link to a publicly accessible document is added to the description, send an introductory email to the fabric@lists.hyperledger.org mailing list linking the JIRA issue, and soliciting feedback.
ml: ആദ്യം, `ജിറ അവലോകനം ചെയ്യാൻ സമയമെടുക്കുക<https://jira.hyperledger.org/issues/?filter=12524>` __ ഒരേ ഫംഗ്ഷനായി ഒരു തുറന്ന (അല്ലെങ്കിൽ അടുത്തിടെ അടച്ച) നിർദ്ദേശം ഇതിനകം ഇല്ലെന്ന് ഉറപ്പുവരുത്താൻ. ഇല്ലെങ്കിൽ, ഒരു ജിറാ എപ്പിക് അല്ലെങ്കിൽ സ്റ്റോറി തുറക്കാൻ ഞങ്ങൾ ശുപാർശ ചെയ്യുന്ന ഒരു നിർദ്ദേശം, ഏത് സാഹചര്യത്തിന് യോജിച്ചതാണെന്ന് തോന്നുന്നതും സവിശേഷത എന്തായിരിക്കുമെന്നും സാധ്യമെങ്കിൽ അത് എങ്ങനെ ചെയ്യാമെന്നും വ്യക്തമാക്കുന്ന പ്രൊപ്പോസലിന്റെ "ഒരു പേജർ link" ലിങ്കുചെയ്യുകയോ ഇൻലൈൻ ചെയ്യുകയോ ചെയ്യുക. നടപ്പിലാക്കേണ്ടതാണ്. സവിശേഷത ആവശ്യമുള്ള പ്രത്യേക ഉപയോഗ കേസ് (കൾ) തിരിച്ചറിയൽ, സവിശേഷത നടപ്പിലാക്കേണ്ടതിന്റെ പ്രയോജനം എന്തായിരിക്കുമെന്നത് എന്നിവ പോലുള്ള സവിശേഷത എന്തുകൊണ്ട് ചേർക്കണം എന്നതിന് ഒരു കേസ് ഉണ്ടാക്കാനും ഇത് സഹായിക്കും. JIRA പ്രശ്നം സൃഷ്ടിച്ചു, ഒപ്പം "ഒരു പേജർ " ഒന്നുകിൽ അറ്റാച്ചുചെയ്തിരിക്കുന്നു, വിവരണ ഫീൽഡിൽ ഇൻലൈൻ ചെയ്തിരിക്കുന്നു, അല്ലെങ്കിൽ പൊതുവായി ആക്‌സസ് ചെയ്യാവുന്ന ഒരു പ്രമാണത്തിലേക്കുള്ള ഒരു ലിങ്ക് വിവരണത്തിലേക്ക് ചേർത്തു, ഒരു ആമുഖ ഇമെയിൽ അയയ്‌ക്കുകഫാബ്രിക് ലിസ്റ്റ്സ്.ഹൈപ്പർലെഡ്ജർ.ഓർഗ് മെയിലിംഗ് ലിസ്റ്റ് ജിറ പ്രശ്‌നത്തെ ലിങ്കുചെയ്യുന്നു, ഒപ്പം ഫീഡ്‌ബാക്ക് അഭ്യർത്ഥിക്കുന്നു

source: Discussion of the proposed feature should be conducted in the JIRA issue itself, so that we have a consistent pattern within our community as to where to find design discussion.
ml: നിർ‌ദ്ദിഷ്‌ട സവിശേഷതയെക്കുറിച്ചുള്ള ചർച്ച ജിറ ലക്കത്തിൽ‌ തന്നെ നടത്തണം, അതിനാൽ‌ ഡിസൈൻ‌ ചർച്ച എവിടെ കണ്ടെത്താമെന്നതിനെക്കുറിച്ച് ഞങ്ങളുടെ കമ്മ്യൂണിറ്റിയിൽ‌ സ്ഥിരമായ ഒരു പാറ്റേൺ‌ ഉണ്ട്.

source: Getting the support of three or more of the Hyperledger Fabric maintainers for the new feature will greatly enhance the probability that the feature's related PRs will be included in a subsequent release.
ml: പുതിയ സവിശേഷതയ്‌ക്കായി മൂന്നോ അതിലധികമോ ഹൈപ്പർലെഡ്ജർ ഫാബ്രിക് പരിപാലകരുടെ പിന്തുണ ലഭിക്കുന്നത് സവിശേഷതയുമായി ബന്ധപ്പെട്ട PR- കൾ തുടർന്നുള്ള പതിപ്പിൽ ഉൾപ്പെടുത്താനുള്ള സാധ്യതയെ വളരെയധികം വർദ്ധിപ്പിക്കും.

source: Maintainers meeting
ml: പരിപാലകന്റെ യോഗം

source: The maintainers hold regular maintainers meetings. The purpose of the maintainers meeting is to plan for and review the progress of releases, and to discuss the technical and operational direction of the project and sub-projects.
ml: പരിപാലകർ പതിവായി പരിപാലിക്കുന്നവരുടെ മീറ്റിംഗുകൾ നടത്തുന്നു. റിലീസുകളുടെ പുരോഗതി ആസൂത്രണം ചെയ്യുകയും അവലോകനം ചെയ്യുകയും പ്രോജക്റ്റിന്റെയും ഉപ പദ്ധതികളുടെയും സാങ്കേതികവും പ്രവർത്തനപരവുമായ ദിശ ചർച്ച ചെയ്യുകയുമാണ് പരിപാലകരുടെ യോഗത്തിന്റെ ലക്ഷ്യം.

source: Please see the `wiki <https://wiki.hyperledger.org/display/fabric/Maintainer+Meetings>`__ for maintainer meeting details.
ml: `വിക്കി 'കാണുക<https://wiki.hyperledger.org/display/fabric/Maintainer+Meetings>` __ ഇതിനായി പരിപാലക മീറ്റിംഗ് വിശദാംശങ്ങൾ."

source: New feature/enhancement proposals as described above should be presented to a maintainers meeting for consideration, feedback and acceptance.
ml: മുകളിൽ വിവരിച്ചതുപോലെ പുതിയ സവിശേഷത / മെച്ചപ്പെടുത്തൽ നിർദ്ദേശങ്ങൾ പരിഗണന, ഫീഡ്‌ബാക്ക്, സ്വീകാര്യത എന്നിവയ്ക്കായി ഒരു പരിപാലകരുടെ മീറ്റിംഗിൽ അവതരിപ്പിക്കണം.

source: Release roadmap
ml: റോഡ്മാപ്പ് റിലീസ് ചെയ്യുക

source: The Fabric release roadmap of epics is maintained in `JIRA <https://jira.hyperledger.org/secure/Dashboard.jspa?selectPageId=10104>`__.`<https://jira.hyperledger.org/secure/Dashboard.jspa?selectPageId=10104>`
ml: ആശയവിനിമയങ്ങൾ

source: We use `RocketChat <https://chat.hyperledger.org/>`__ for communication and Google Hangouts™ for screen sharing between developers. Our development planning and prioritization is done in `JIRA <https://jira.hyperledger.org>`__, and we take longer running discussions/decisions to the `mailing list <https://lists.hyperledger.org/mailman/listinfo/hyperledger-fabric>`__.
ml: ഡവലപ്പർമാർ തമ്മിലുള്ള സ്‌ക്രീൻ പങ്കിടലിനായി ഞങ്ങൾ `റോക്കറ്റ്ചാറ്റ് <https://chat.hyperledger.org/>` __ ആശയവിനിമയത്തിനും Google Hangouts use ഉപയോഗിക്കുന്നു. ഞങ്ങളുടെ വികസന ആസൂത്രണവും മുൻ‌ഗണനയും `JIRA <https://jira.hyperledger.org>` __ ൽ ചെയ്തു, കൂടാതെ മെയിലിംഗ് ലിസ്റ്റിലേക്ക് <https://lists.hyperledger.org/mailman/listinfo/hyperledger-fabric>`__.

source: Contribution guide
ml: സംഭാവന ഗൈഡ്

source: Install prerequisites
ml: മുൻവ്യവസ്ഥകൾ ഇൻസ്റ്റാൾ ചെയ്യുക

source: Before we begin, if you haven't already done so, you may wish to check that you have all the :doc:`prerequisites <prereqs>` installed on the platform(s) on which you'll be developing blockchain applications and/or operating Hyperledger Fabric.
ml: ആരംഭിക്കുന്നതിന് മുമ്പ്, നിങ്ങൾ ഇതിനകം അങ്ങനെ ചെയ്തിട്ടില്ലെങ്കിൽ, നിങ്ങൾക്ക് ഇവയെല്ലാം ഉണ്ടോയെന്ന് പരിശോധിക്കാൻ നിങ്ങൾ ആഗ്രഹിച്ചേക്കാം: doc: `മുൻവ്യവസ്ഥകൾ <prereqs> പ്ലാറ്റ്‌ഫോമിൽ (കളിൽ) ഇൻസ്റ്റാളുചെയ്‌തിട്ടുണ്ട്, അതിൽ നിങ്ങൾ ബ്ലോക്ക്‌ചെയിൻ അപ്ലിക്കേഷനുകൾ വികസിപ്പിക്കുകയും കൂടാതെ / അല്ലെങ്കിൽ ഓപ്പറേറ്റിംഗ് നടത്തുകയും ചെയ്യും ഹൈപ്പർലെഡ്ജർ ഫാബ്രിക്.

source: Getting help
ml: സഹായം ലഭിക്കുന്നതിന്

source: If you are looking for something to work on, or need some expert assistance in debugging a problem or working out a fix to an issue, our `community <https://www.hyperledger.org/community>`__ is always eager to help. We hang out on `Chat <https://chat.hyperledger.org/channel/fabric/>`__, IRC (#hyperledger on freenode.net) and the `mailing lists <https://lists.hyperledger.org/>`__. Most of us don't bite :grin: and will be glad to help. The only silly question is the one you don't ask. Questions are in fact a great way to help improve the project as they highlight where our documentation could be clearer.
ml: നിങ്ങൾ‌ എന്തെങ്കിലും പ്രവർ‌ത്തിക്കാൻ‌ നോക്കുകയാണെങ്കിലോ ഒരു പ്രശ്‌നം ഡീബഗ്ഗ് ചെയ്യുന്നതിനോ അല്ലെങ്കിൽ‌ ഒരു പ്രശ്‌നം പരിഹരിക്കുന്നതിനോ ചില വിദഗ്ദ്ധ സഹായം ആവശ്യമുണ്ടെങ്കിലോ, ഞങ്ങളുടെ `കമ്മ്യൂണിറ്റി <https://www.hyperledger.org/community>` __ എല്ലായ്‌പ്പോഴും ആകാംക്ഷയോടെ കാത്തിരിക്കുന്നു സഹായിക്കുന്നതിന് . `ചാറ്റ് <https://chat.hyperledger.org/channel/fabric/>` __, IRC (freenode.net- ലെ #hyperledger), `മെയിലിംഗ് ലിസ്റ്റുകൾ <https://lists.hyperledger.org/ > `__.ഞങ്ങളിൽ ഭൂരിഭാഗവും കടിക്കില്ല: ചിരി: സഹായിക്കാൻ സന്തോഷമാണ് . ഞങ്ങളുടെ ഡോക്യുമെന്റേഷൻ എവിടെയാണെന്ന് എടുത്തുകാണിക്കുന്നതിനനുസരിച്ച് പ്രോജക്റ്റ് മെച്ചപ്പെടുത്താൻ സഹായിക്കുന്നതിനുള്ള മികച്ച മാർഗമാണ് ചോദ്യങ്ങൾ.

source: Reporting bugs
ml: ബഗുകൾ റിപ്പോർട്ടുചെയ്യുന്നതിന്

source: If you are a user and you have found a bug, please submit an issue using `JIRA <https://jira.hyperledger.org/secure/Dashboard.jspa?selectPageId=10104>`__. Before you create a new JIRA issue, please try to search the existing items to be sure no one else has previously reported it. If it has been previously reported, then you might add a comment that you also are interested in seeing the defect fixed.
ml: നിങ്ങൾ ഒരു ഉപയോക്താവാണെങ്കിൽ നിങ്ങൾ ഒരു ബഗ് കണ്ടെത്തിയിട്ടുണ്ടെങ്കിൽ, `JIRA 'ഉപയോഗിച്ച് ഒരു പ്രശ്നം സമർപ്പിക്കുക<https://jira.hyperledger.org/secure/Dashboard.jspa?selectPageId=10104> `__.നിങ്ങൾ ഒരു പുതിയ ജിറ പ്രശ്നം സൃഷ്ടിക്കുന്നതിനുമുമ്പ്, മറ്റാരും മുമ്പ് റിപ്പോർട്ട് ചെയ്തിട്ടില്ലെന്ന് ഉറപ്പാക്കാൻ നിലവിലുള്ള ഇനങ്ങൾ തിരയാൻ ശ്രമിക്കുക. ഇത് മുമ്പ് റിപ്പോർട്ടുചെയ്തിട്ടുണ്ടെങ്കിൽ, തകരാറ് പരിഹരിക്കാൻ നിങ്ങൾക്കും താൽപ്പര്യമുണ്ടെന്ന് ഒരു അഭിപ്രായം ചേർക്കാം.

source: If the defect is security-related, please follow the Hyperledger `security bug reporting process <https://wiki.hyperledger.org/display/HYP/Defect+Response>`__.
ml: തകരാർ‌ സുരക്ഷയുമായി ബന്ധപ്പെട്ടതാണെങ്കിൽ‌, ദയവായി ഹൈപ്പർ‌ലെഡ്ജർ‌ `സുരക്ഷാ ബഗ് റിപ്പോർ‌ട്ടിംഗ് പ്രക്രിയ <https://wiki.hyperledger.org/display/HYP/Defect+Response>` __ പിന്തുടരുക.

source: If it has not been previously reported, you may either submit a PR with a well documented commit message describing the defect and the fix, or you may create a new JIRA. Please try to provide sufficient information for someone else to reproduce the issue. One of the project's maintainers should respond to your issue within 24 hours. If not, please bump the issue with a comment and request that it be reviewed. You can also post to the relevant Hyperledger Fabric channel in `Hyperledger Chat <https://chat.hyperledger.org>`__. For example, a doc bug should be broadcast to ``#fabric-documentation``, a database bug to ``#fabric-ledger``, and so on...
ml: ഇത് മുമ്പ് റിപ്പോർട്ടുചെയ്തിട്ടില്ലെങ്കിൽ, ഒന്നുകിൽ നിങ്ങൾക്ക് ഒരു ഡോക്യുമെന്റ് കമ്മിറ്റ് സന്ദേശമുപയോഗിച്ച് ഒരു പിആർ സമർപ്പിക്കാം, അല്ലെങ്കിൽ തകരാറും പരിഹാരവും വിവരിക്കാം, അല്ലെങ്കിൽ നിങ്ങൾക്ക് ഒരു പുതിയ ജിറ സൃഷ്ടിക്കാം. പ്രശ്നം പുനർനിർമ്മിക്കുന്നതിന്മറ്റൊരാൾക്ക് മതിയായ വിവരങ്ങൾ നൽകാൻ ശ്രമിക്കുക. പ്രോജക്റ്റിന്റെ പരിപാലകരിലൊരാൾ നിങ്ങളുടെ പ്രശ്നത്തോട് 24 മണിക്കൂറിനുള്ളിൽ പ്രതികരിക്കണം. ഇല്ലെങ്കിൽ‌, ദയവായി ഒരു അഭിപ്രായമുപയോഗിച്ച് പ്രശ്‌നം പരിഹരിക്കുക, അത് അവലോകനം ചെയ്യാൻ അഭ്യർത്ഥിക്കുക.`ഹൈപ്പർലെഡ്ജർ ചാറ്റ് <https://chat.hyperledger.org>` __ എന്നതിൽ നിങ്ങൾക്ക് പ്രസക്തമായ ഹൈപ്പർലെഡ്ജർ ഫാബ്രിക് ചാനലിലേക്ക് പോസ്റ്റുചെയ്യാനും കഴിയും. ഉദാഹരണത്തിന്, ഒരു ഡോക് ബഗ് `` # ഫാബ്രിക്-ഡോക്യുമെന്റേഷൻ`` ലേക്ക് ഒരു ഡാറ്റാബേസ് ""ബഗ് `` # ഫാബ്രിക്-ലെഡ്ജർ`` ലേക്ക് പ്രക്ഷേപണം ചെയ്യണം, അങ്ങനെ ...

source: Submitting your fix
ml: നിങ്ങളുടെ പരിഹാരം സമർപ്പിക്കുന്നതിന്

source: If you just submitted a JIRA for a bug you've discovered, and would like to provide a fix, we would welcome that gladly! Please assign the JIRA issue to yourself, then submit a pull request (PR). Please refer to :doc:`github/github` for a detailed workflow.
ml: നിങ്ങൾ കണ്ടെത്തിയ ഒരു ബഗിനായി നിങ്ങൾ ഒരു ജിറ സമർപ്പിക്കുകയും ഒരു പരിഹാരം നൽകാൻ ആഗ്രഹിക്കുകയും ചെയ്യുന്നുവെങ്കിൽ, ഞങ്ങൾ അത് സന്തോഷപൂർവ്വം സ്വാഗതം ചെയ്യും! JIRA പ്രശ്നം നിങ്ങൾക്ക് തന്നെ നൽകുക, തുടർന്ന് ഒരു പുൾ അഭ്യർത്ഥന (PR)" "സമർപ്പിക്കുക. വിശദമായ വർക്ക്ഫ്ലോയ്ക്കായി ദയവായി: doc: `github / github` റഫർ ചെയ്യുക.

source: Fixing issues and working stories
ml: പ്രശ്‌നങ്ങൾ പരിഹരിക്കുന്നതിനും പ്രവർത്തിക്കുന്ന സ്റ്റോറികൾക്കും

source: Review the `issues list <https://jira.hyperledger.org/issues/?filter=10580>`__ and find something that interests you. You could also check the `"help-wanted" <https://jira.hyperledger.org/issues/?filter=10147>`__ list. It is wise to start with something relatively straight forward and achievable, and that no one is already assigned. If no one is assigned, then assign the issue to yourself. Please be considerate and rescind the assignment if you cannot finish in a reasonable time, or add a comment saying that you are still actively working the issue if you need a little more time.സഹായം ആവശ്യമുള്ളവർ check പരിശോധിക്കാനും കഴിയും<https://jira.hyperledger.org/issues/?filter=10147> `__ പട്ടിക. താരതമ്യേന നേരെയുള്ളതും കൈവരിക്കാവുന്നതും ആരെയും ഇതിനകം നിയോഗിച്ചിട്ടില്ലാത്തതുമായ എന്തെങ്കിലും ആരംഭിക്കുന്നത് ബുദ്ധിയാണ്. ആരെയും നിയോഗിച്ചിട്ടില്ലെങ്കിൽ, പ്രശ്നം നിങ്ങൾക്ക്" "തന്നെ നൽകുക. നിങ്ങൾക്ക് ന്യായമായ സമയത്ത് പൂർത്തിയാക്കാൻ കഴിയുന്നില്ലെങ്കിൽ ദയവായി പരിഗണിച്ച് അസൈൻമെന്റ് റദ്ദാക്കുക, അല്ലെങ്കിൽ കുറച്ച് സമയം കൂടി ആവശ്യമെങ്കിൽ നിങ്ങൾ ഇപ്പോഴും പ്രശ്നം സജീവമായി പ്രവർത്തിക്കുന്നുണ്ടെന്ന് ഒരു അഭിപ്രായം ചേർക്കുക.
ml: സമർപ്പിച്ച പുൾ അഭ്യർത്ഥനകൾ (പിആർ) അവലോകനം ചെയ്യുന്നതിന്

source: Another way to contribute and learn about Hyperledger Fabric is to help the maintainers with the review of the PRs that are open. Indeed maintainers have the difficult role of having to review all the PRs that are being submitted and evaluate whether they should be merged or not. You can review the code and/or documentation changes, test the changes, and tell the submitters and maintainers what you think. Once your review and/or test is complete just reply to the PR with your findings, by adding comments and/or voting. A comment saying something like "I tried it on system X and it works" or possibly "I got an error on system X: xxx " will help the maintainers in their evaluation. As a result, maintainers will be able to process PRs faster and everybody will gain from it.
ml: ഹൈപ്പർലെഡ്ജർ ഫാബ്രിക്കിനെക്കുറിച്ച് സംഭാവന ചെയ്യുന്നതിനും പഠിക്കുന്നതിനുമുള്ള മറ്റൊരു മാർഗ്ഗം, തുറന്നിരിക്കുന്ന PR- കളുടെ അവലോകനത്തിന് പരിപാലകരെ സഹായിക്കുക എന്നതാണ്. സമർപ്പിക്കുന്ന എല്ലാ PR- കളും അവലോകനം ചെയ്യേണ്ടതും ലയിപ്പിക്കണമോ" "വേണ്ടയോ എന്ന് വിലയിരുത്തുന്നതും പരിപാലകർക്ക് ബുദ്ധിമുട്ടുള്ള പങ്കാണ്. നിങ്ങൾക്ക് കോഡ് കൂടാതെ / അല്ലെങ്കിൽ ഡോക്യുമെന്റേഷൻ മാറ്റങ്ങൾ അവലോകനം ചെയ്യാനും മാറ്റങ്ങൾ പരിശോധിക്കാനും സമർപ്പിക്കുന്നവരോടും പരിപാലകരോടും നിങ്ങളുടെ അഭിപ്രായം പറയാൻ കഴിയും." "നിങ്ങളുടെ അവലോകനവും കൂടാതെ / അല്ലെങ്കിൽ പരിശോധനയും പൂർത്തിയായാൽ അഭിപ്രായങ്ങളും കൂടാതെ / അല്ലെങ്കിൽ വോട്ടിംഗും ചേർത്ത് നിങ്ങളുടെ കണ്ടെത്തലുകൾക്കൊപ്പം PR- ന് മറുപടി നൽകുക. X സിസ്റ്റം X- ൽ ഞാൻ ഇത് പരീക്ഷിച്ചു, അത് പ്രവർത്തിക്കുന്നു അല്ലെങ്കിൽ ഒരുപക്ഷേ X സിസ്റ്റം X- ൽ എനിക്ക് ഒരു പിശക് സംഭവിച്ചു: xxx like പോലുള്ള ഒരു അഭിപ്രായം പരിപാലകരെ അവരുടെ മൂല്യനിർണ്ണയത്തിൽ സഹായിക്കും. ഫലമായി,പരിപാലകർക്ക് PR- കൾ വേഗത്തിൽ പ്രോസസ്സ് ചെയ്യാൻ കഴിയും, ഒപ്പം എല്ലാവരും അതിൽ നിന്ന് നേട്ടമുണ്ടാക്കുകയും ചെയ്യും.

source: Just browse through `the open PRs on GitHub <https://github.com/hyperledger/fabric/pulls>`__ to get started.
ml: ആരംഭിക്കുന്നതിന് GitHub- ലെ ഓപ്പൺ PR- കളിലൂടെ ബ്രൗസുചെയ്യുക<https://github.com/hyperledger/fabric/pulls>` __

source: PR Aging
ml: പിആർ ഏജിംഗ്
