Repository: gokulnathg14/fabric-docs-ml
Catalog: docs/source/locale/*/LC_MESSAGES/CONTRIBUTING.po
Languages: ml

source: As the Fabric project has grown, so too has the backlog of open PRs. One problem that nearly all projects face is effectively managing that backlog and Fabric is no exception. In an effort to keep the backlog of Fabric and related project PRs manageable, we are introducing an aging policy which will be enforced by bots. This is consistent with how other large projects manage their PR backlog.
ml: ഫാബ്രിക് പ്രോജക്റ്റ് വളരുന്നതിനനുസരിച്ച് ഓപ്പൺ പിആർമാരുടെ ബാക്ക്ലോഗും വളർന്നു. മിക്കവാറും എല്ലാ പ്രോജക്റ്റുകളും അഭിമുഖീകരിക്കുന്ന ഒരു പ്രശ്നം ബാക്ക്‌ലോഗും ഫാബ്രിക്കും ഒരു അപവാദമല്ലെന്ന് ഫലപ്രദമായി കൈകാര്യം ചെയ്യുക എന്നതാണ്. ഫാബ്രിക്കിന്റെയും" "അനുബന്ധ പ്രോജക്റ്റ് പി‌ആർ‌മാരുടെയും ബാക്ക്‌ലോഗ് കൈകാര്യം ചെയ്യാൻ‌ കഴിയുന്ന തരത്തിൽ, ഞങ്ങൾ‌ ഒരു ഏജിംഗ് നയം അവതരിപ്പിക്കുന്നു, അത് ബോട്ടുകൾ‌ നടപ്പിലാക്കും. മറ്റ് വലിയ പ്രോജക്ടുകൾ അവരുടെ പിആർ ബാക്ക്ലോഗ് എങ്ങനെ കൈകാര്യം ചെയ്യുന്നു എന്നതുമായി" "ഇത് പൊരുത്തപ്പെടുന്നു.

source: PR Aging Policy
ml: പിആർ ഏജിംഗ് പോളിസി

source: The Fabric project maintainers will automatically monitor all PR activity for delinquency. If a PR has not been updated in 2 weeks, a reminder comment will be added requesting that the PR either be updated to address any outstanding comments or abandoned if it is to be withdrawn. If a delinquent PR goes another 2 weeks without an update, it will be automatically abandoned. If a PR has aged more than 2 months since it was originally submitted, even if it has activity, it will be flagged for maintainer review.
ml: കുറ്റകൃത്യങ്ങൾ പരിശോധിക്കുന്നതിനായി ഫാബ്രിക് പ്രോജക്റ്റ് പരിപാലകർ എല്ലാ പിആർ പ്രവർത്തനങ്ങളും യാന്ത്രികമായി നിരീക്ഷിക്കും. 2 ആഴ്ചയ്ക്കുള്ളിൽ ഒരു പിആർ അപ്‌ഡേറ്റ് ചെയ്തിട്ടില്ലെങ്കിൽ, പിആർ പിൻവലിക്കണമെങ്കിൽ, കുടിശ്ശികയുള്ള ഏതെങ്കിലും അഭിപ്രായങ്ങളെ" "അഭിസംബോധന ചെയ്യുന്നതിനായി പിആർ അപ്‌ഡേറ്റ് ചെയ്യുകയോ ഉപേക്ഷിക്കുകയോ ചെയ്യണമെന്ന് അഭ്യർത്ഥിച്ച് ഒരു ഓർമ്മപ്പെടുത്തൽ അഭിപ്രായം ചേർക്കും. കുറ്റവാളിയായ PR അപ്‌ഡേറ്റ് ഇല്ലാതെ 2 ആഴ്ച കൂടി പോയാൽ, അത് യാന്ത്രികമായി ഉപേക്ഷിക്കപ്പെടും. ഒരു PR" "യഥാർത്ഥത്തിൽ സമർപ്പിച്ചതിനുശേഷം 2 മാസത്തിൽ കൂടുതൽ പ്രായമുണ്ടെങ്കിൽ, പ്രവർത്തനമുണ്ടെങ്കിൽപ്പോലും, അത് പരിപാലക അവലോകനത്തിനായി ഫ്ലാഗുചെയ്യപ്പെടും.

source: If a submitted PR has passed all validation but has not been reviewed in 72 hours (3 days), it will be flagged to the #fabric-pr-review channel daily until it receives a review comment(s).
ml: സമർപ്പിച്ച PR എല്ലാ മൂല്യനിർണ്ണയങ്ങളും പാസാക്കിയിട്ടുണ്ടെങ്കിലും 72 മണിക്കൂറിനുള്ളിൽ (3 ദിവസം) അവലോകനം ചെയ്തിട്ടില്ലെങ്കിൽ, ഒരു അവലോകന അഭിപ്രായം (കൾ) ലഭിക്കുന്നതുവരെ ഇത് # ഫാബ്രിക്-പ്രി-റിവ്യൂ ചാനലിലേക്ക് ഫ്ലാഗുചെയ്യും.

source: This policy applies to all official Fabric projects (fabric, fabric-ca, fabric-samples, fabric-test, fabric-sdk-node, fabric-sdk-java, fabric-gateway-java, fabric-chaincode-node, fabric-chaincode-java, fabric-chaincode-evm, fabric-baseimage, and fabric-amcl).
ml: ഈ നയം എല്ലാ ഔദ്യോഗിക ഫാബ്രിക് പ്രോജക്റ്റുകൾക്കും (fabric, fabric-ca, fabric-samples, fabric-test, fabric-sdk-node, fabric-sdk-java, fabric-gateway-java, fabric-chaincode-node, fabric-chaincode-java, fabric-chaincode-evm, fabric-baseimage, and fabric-amcl).

source: Setting up development environment
ml: വികസന അന്തരീക്ഷം സജ്ജീകരിക്കുന്നതിന്

source: Next, try :doc:`building the project <dev-setup/build>` in your local development environment to ensure that everything is set up correctly.
ml: അടുത്തതായി, എല്ലാം ശരിയായി സജ്ജമാക്കിയിട്ടുണ്ടെന്ന് ഉറപ്പാക്കുന്നതിന് നിങ്ങളുടെ പ്രാദേശിക വികസന പരിതസ്ഥിതിയിൽ <dev-setup / build> പ്രോജക്റ്റ് നിർമ്മിക്കുക.

source: What makes a good pull request?
ml: എന്താണ് നല്ലൊരു പുൾ അഭ്യർത്ഥന?

source: One change at a time. Not five, not three, not ten. One and only one. Why? Because it limits the blast area of the change. If we have a regression, it is much easier to identify the culprit commit than if we have some composite change that impacts more of the code.
ml: ഒരു സമയം ഒരു മാറ്റം. അഞ്ച് അല്ല, മൂന്ന് അല്ല, പത്ത് അല്ല. ഒന്ന് മാത്രം.എന്തുകൊണ്ട്? കാരണം ഇത് മാറ്റത്തിന്റെ സ്ഫോടന മേഖലയെ പരിമിതപ്പെടുത്തുന്നു. ഞങ്ങൾക്ക് ഒരു റിഗ്രഷൻ ഉണ്ടെങ്കിൽ, കൂടുതൽ കോഡിനെ ബാധിക്കുന്ന ചില സംയോജിത മാറ്റങ്ങളുണ്ടെങ്കിൽ കുറ്റവാളിയെ തിരിച്ചറിയുന്നത് വളരെ എളുപ്പമാണ്.

source: Include a link to the JIRA story for the change. Why? Because a) we want to track our velocity to better judge what we think we can deliver and when and b) because we can justify the change more effectively. In many cases, there should be some discussion around a proposed change and we want to link back to that from the change itself.
ml: മാറ്റത്തിനായി ജിറ സ്റ്റോറിയിലേക്ക് ഒരു ലിങ്ക് ഉൾപ്പെടുത്തുക. എന്തുകൊണ്ട്? കാരണം, ഒന്നാമതായി, ഞങ്ങൾക്ക് കൈമാറാൻ കഴിയുമെന്ന് ഞങ്ങൾ കരുതുന്ന കാര്യങ്ങൾ നന്നായി വിഭജിക്കാനുള്ള വേഗത ട്രാക്കുചെയ്യാൻ ഞങ്ങൾ ആഗ്രഹിക്കുന്നു, രണ്ടാമത്, മാറ്റത്തെ കൂടുതൽ ഫലപ്രദമായി ന്യായീകരിക്കാൻ ഞങ്ങൾക്ക് കഴിയും. മിക്ക കേസുകളിലും, ഒരു നിർദ്ദിഷ്ട മാറ്റത്തെക്കുറിച്ച് ചില ചർച്ചകൾ ഉണ്ടായിരിക്കണം, മാത്രമല്ല മാറ്റത്തിൽ നിന്ന് തന്നെ അതിലേക്ക് തിരികെ ബന്ധിപ്പിക്കാൻ ഞങ്ങൾ ആഗ്രഹിക്കുന്നു.

source: Include unit and integration tests (or changes to existing tests) with every change. This does not mean just happy path testing, either. It also means negative testing of any defensive code that it correctly catches input errors. When you write code, you are responsible to test it and provide the tests that demonstrate that your change does what it claims. Why? Because without this we have no clue whether our current code base actually works.
ml: ഓരോ മാറ്റത്തിനൊപ്പം യൂണിറ്റ്, ഇന്റഗ്രേഷൻ ടെസ്റ്റുകൾ (അല്ലെങ്കിൽ നിലവിലുള്ള ടെസ്റ്റുകളിലെ മാറ്റങ്ങൾ) ഉൾപ്പെടുത്തുക. ഒന്നുകിൽ സന്തോഷകരമായ പാത്ത് പരിശോധന എന്നല്ല ഇതിനർത്ഥം. ഇൻപുട്ട് പിശകുകൾ ശരിയായി കണ്ടെത്തുന്ന ഏതെങ്കിലും പ്രതിരോധ കോഡിന്റെ നെഗറ്റീവ് പരിശോധന എന്നും ഇത് അർത്ഥമാക്കുന്നു. നിങ്ങൾ കോഡ് എഴുതുമ്പോൾ, അത് പരിശോധിച്ച് നിങ്ങളുടെ മാറ്റം അവകാശപ്പെടുന്ന കാര്യങ്ങൾ ചെയ്യുന്നുവെന്ന് തെളിയിക്കുന്ന പരിശോധനകൾ" "നൽകേണ്ടത് നിങ്ങളുടെ ഉത്തരവാദിത്തമാണ്. എന്തുകൊണ്ട്? കാരണം ഇത് കൂടാതെ ഞങ്ങളുടെ നിലവിലെ കോഡ് ബേസ് യഥാർത്ഥത്തിൽ പ്രവർത്തിക്കുന്നുണ്ടോ എന്നതിനെക്കുറിച്ച് ഞങ്ങൾക്ക് ഒരു സൂചനയും ഇല്ല.

source: Unit tests should have NO external dependencies. You should be able to run unit tests in place with ``go test`` or equivalent for the language. Any test that requires some external dependency (e.g. needs to be scripted to run another component) needs appropriate mocking. Anything else is not unit testing, it is integration testing by definition. Why? Because many open source developers do Test Driven Development. They place a watch on the directory that invokes the tests automagically as the code is changed. This is far more efficient than having to run a whole build between code changes. See `this definition <http://artofunittesting.com/definition-of-a-unit-test/>`__ of unit testing for a good set of criteria to keep in mind for writing effective unit tests.
ml: യൂണിറ്റ് ടെസ്റ്റുകൾക്ക് ബാഹ്യ ആശ്രയത്വങ്ങളൊന്നും ഉണ്ടായിരിക്കരുത്. `` ഗോ ടെസ്റ്റ്`` അല്ലെങ്കിൽ ഭാഷയ്‌ക്ക് തുല്യമായ സ്ഥലത്ത് നിങ്ങൾക്ക് യൂണിറ്റ് ടെസ്റ്റുകൾ പ്രവർത്തിപ്പിക്കാൻ കഴിയും. ചില ബാഹ്യ ആശ്രയത്വം ആവശ്യമുള്ള ഏത് പരിശോധനയ്ക്കും (ഉദാ. മറ്റൊരു ഘടകം പ്രവർത്തിപ്പിക്കുന്നതിന് സ്ക്രിപ്റ്റ് ചെയ്യേണ്ടതുണ്ട്) ഉചിതമായ പരിഹാസം ആവശ്യമാണ്. മറ്റെന്തെങ്കിലും യൂണിറ്റ് പരിശോധനയല്ല, നിർവചനം അനുസരിച്ച് സംയോജന പരിശോധനയാണ്." "എന്തുകൊണ്ട്? കാരണം പല ഓപ്പൺ സോഴ്‌സ് ഡവലപ്പർമാരും ടെസ്റ്റ് ഡ്രൈവൻ ഡവലപ്‌മെന്റ് നടത്തുന്നു. കോഡ് മാറ്റുന്നതിനനുസരിച്ച് യാന്ത്രികമായി പരിശോധനകൾ ആവശ്യപ്പെടുന്ന ഡയറക്‌ടറിയിൽ അവർ ഒരു വാച്ച് സ്ഥാപിക്കുന്നു. കോഡ് മാറ്റങ്ങൾക്കിടയിൽ ഒരു മുഴുവൻ" "ബിൽഡ് പ്രവർത്തിപ്പിക്കുന്നതിനേക്കാൾ ഇത് വളരെ കാര്യക്ഷമമാണ്. ഫലപ്രദമായ യൂണിറ്റ് ടെസ്റ്റുകൾ എഴുതുന്നതിന് മനസ്സിൽ സൂക്ഷിക്കുന്നതിനുള്ള നല്ല മാനദണ്ഡങ്ങൾക്കായി യൂണിറ്റ് പരിശോധനയുടെ `ഈ നിർവചനം <http://artofunittesting.com/definition-of-a-unit-test/>` __ കാണുക.

source: Minimize the lines of code per PR. Why? Maintainers have day jobs, too. If you send a 1,000 or 2,000 LOC change, how long do you think it takes to review all of that code? Keep your changes to < 200-300 LOC, if possible. If you have a larger change, decompose it into multiple independent changes. If you are adding a bunch of new functions to fulfill the requirements of a new capability, add them separately with their tests, and then write the code that uses them to deliver the capability. Of course, there are always exceptions. If you add a small change and then add 300 LOC of tests, you will be forgiven;-) If you need to make a change that has broad impact or a bunch of generated code (protobufs, etc.). Again, there can be exceptions.
ml: ഓരോ PR- നും കോഡ് വരികൾ കുറയ്‌ക്കുക. എന്തുകൊണ്ട്? പരിപാലകർക്ക് ഡേ ജോലികളും ഉണ്ട്. നിങ്ങൾ 1,000 അല്ലെങ്കിൽ 2,000 LOC മാറ്റം അയയ്ക്കുകയാണെങ്കിൽ, ആ കോഡുകളെല്ലാം അവലോകനം ചെയ്യാൻ എത്ര സമയമെടുക്കുമെന്ന് നിങ്ങൾ കരുതുന്നു?" "കഴിയുമെങ്കിൽ , നിങ്ങളുടെ മാറ്റങ്ങൾ <200-300 LOC ആയി നിലനിർത്തുക. നിങ്ങൾക്ക് ഒരു വലിയ മാറ്റമുണ്ടെങ്കിൽ, ഒന്നിലധികം സ്വതന്ത്ര മാറ്റങ്ങളായി വിഘടിപ്പിക്കുക.ഒരു പുതിയ ശേഷിയുടെ ആവശ്യകതകൾ‌ നിറവേറ്റുന്നതിനായി നിങ്ങൾ‌ ഒരു കൂട്ടം പുതിയ ഫംഗ്ഷനുകൾ‌ ചേർ‌ക്കുകയാണെങ്കിൽ‌, അവരുടെ ടെസ്റ്റുകൾ‌ക്കൊപ്പം അവയെ പ്രത്യേകം ചേർ‌ക്കുക, തുടർന്ന്‌ ശേഷി നൽകുന്നതിന് അവ ഉപയോഗിക്കുന്ന കോഡ് എഴുതുക. അസാധാരണമായ അവസരങ്ങളിൽ മാറ്റങ്ങൾ ഉണ്ടാവാം . നിങ്ങളോട് ക്ഷമിക്കപ്പെടും ;-) എപ്പോൾ, നിങ്ങൾ ഒരു ചെറിയ മാറ്റം ചേർത്ത് 300 എൽ‌ഒ‌സി ടെസ്റ്റുകൾ‌ ചേർ‌ക്കുകയാണെങ്കിൽ‌, വിശാലമായ സ്വാധീനം ചെലുത്തുന്ന അല്ലെങ്കിൽ‌ ജനറേറ്റുചെയ്‌ത ഒരു കൂട്ടം കോഡുകൾ‌ (പ്രോട്ടോബുഫുകൾ‌ മുതലായവ) മാറ്റാൻ‌ കഴിയുമെങ്കിൽ‌ മാത്രം. വീണ്ടും, അസാധാരണമായ അവസരങ്ങളിൽ മാറ്റങ്ങൾ ഉണ്ടാവാം

source: Large pull requests, e.g. those with more than 300 LOC are more than likely not going to receive an approval, and you'll be asked to refactor the change to conform with this guidance.
ml: വലിയ പുൾ അഭ്യർത്ഥനകൾ, ഉദാ. 300 ൽ കൂടുതൽ എൽ‌ഒ‌സി ഉള്ളവർ‌ ഒരു അംഗീകാരം സ്വീകരിക്കാൻ‌ സാധ്യതയില്ല, മാത്രമല്ല ഈ മാർ‌ഗ്ഗനിർ‌ദ്ദേശത്തിന് അനുസൃതമായി മാറ്റം വരുത്താൻ‌ നിങ്ങളോട് ആവശ്യപ്പെടും.

source: Write a meaningful commit message. Include a meaningful 55 (or less) character title, followed by a blank line, followed by a more comprehensive description of the change. Each change MUST include the JIRA identifier corresponding to the change (e.g. [FAB-1234]). This can be in the title but should also be in the body of the commit message.
ml: അർത്ഥവത്തായ പ്രതിബദ്ധത സന്ദേശം എഴുതുക. അർത്ഥവത്തായ 55 (അല്ലെങ്കിൽ‌ അതിൽ‌ കുറവ്) പ്രതീക ശീർ‌ഷകം ഉൾ‌പ്പെടുത്തുക, അതിന് ശേഷം ഒരു ശൂന്യമായ വരിയും തുടർന്ന്‌ മാറ്റത്തെക്കുറിച്ച് കൂടുതൽ‌ സമഗ്രമായ വിവരണവും ഉൾ‌പ്പെടുത്തുക. ഓരോ മാറ്റത്തിലും മാറ്റത്തിന് അനുയോജ്യമായ JIRA ഐഡന്റിഫയർ ഉൾപ്പെടുത്തണം (ഉദാ. [FAB-1234]). ഇത് ശീർഷകത്തിലാകാം, പക്ഷേ പ്രതിബദ്ധത സന്ദേശത്തിന്റെ ബോഡിയിലും ആയിരിക്കണം.

source: Example commit message:
ml: ഉദാഹരണം കമ്മിറ്റ് സന്ദേശം:

source: Finally, be responsive. Don't let a pull request fester with review comments such that it gets to a point that it requires a rebase. It only further delays getting it merged and adds more work for you - to remediate the merge conflicts.
ml: അവസാനമായി, പ്രതികരിക്കുക. അവലോകന അഭിപ്രായങ്ങളുള്ള ഒരു പുൾ അഭ്യർത്ഥനയെ ഒരു റിബേസ് ആവശ്യപ്പെടുന്ന ഒരു ഘട്ടത്തിലേക്ക് എത്തിക്കാൻ അനുവദിക്കരുത്. ഇത് ലയിപ്പിക്കുന്നതിന് കൂടുതൽ കാലതാമസം വരുത്തുകയും ലയന വൈരുദ്ധ്യങ്ങൾ പരിഹരിക്കുന്നതിന് നിങ്ങൾക്കായി കൂടുതൽ ജോലി ചേർക്കുകയും ചെയ്യുന്നു.

source: Legal stuff
ml: നിയമപരമായ കാര്യങ്ങൾ

source: **Note:** Each source file must include a license header for the Apache Software License 2.0. See the template of the `license header <https://github.com/hyperledger/fabric/blob/master/docs/source/dev-setup/headers.txt>`__.
ml: ** കുറിപ്പ്: ** ഓരോ ഉറവിട ഫയലിലും അപ്പാച്ചെ സോഫ്റ്റ്വെയർ ലൈസൻസ് 2.0 നായുള്ള ലൈസൻസ് ഹെഡർ ഉൾപ്പെടുത്തണം. `ലൈസൻസ് ഹെഡറിന്റെ 'ടെംപ്ലേറ്റ് കാണുക<https://github.com/hyperledger/fabric/blob/master/docs/source/dev-setup/headers.txt>`__.

source: We have tried to make it as easy as possible to make contributions. This applies to how we handle the legal aspects of contribution. We use the same approach—the `Developer's Certificate of Origin 1.1 (DCO) <https://github.com/hyperledger/fabric/blob/master/docs/source/DCO1.1.txt>`__—that the Linux® Kernel `community <https://elinux.org/Developer_Certificate_Of_Origin>`__ uses to manage code contributions.
ml: സംഭാവന നൽകുന്നത് കഴിയുന്നത്ര എളുപ്പമാക്കാൻ ഞങ്ങൾ ശ്രമിച്ചു. സംഭാവനയുടെ നിയമപരമായ വശങ്ങൾ ഞങ്ങൾ എങ്ങനെ കൈകാര്യം ചെയ്യുന്നു എന്നതിന് ഇത് ബാധകമാണ്. ഞങ്ങൾ അതേ സമീപനമാണ് ഉപയോഗിക്കുന്നത് `` ഡവലപ്പറുടെ ഉറവിട സർട്ടിഫിക്കറ്റ് 1.1 (DCO) <https://github.com/hyperledger/fabric/blob/master/docs/source/DCO1.1.txt> `__— കോഡ് സംഭാവനകൾ നിയന്ത്രിക്കാൻ കേർണൽ `കമ്മ്യൂണിറ്റി <https://elinux.org/Developer_Certificate_Of_Origin>` __ ഉപയോഗിക്കുന്നു.

source: We simply ask that when submitting a patch for review, the developer must include a sign-off statement in the commit message.
ml: അവലോകനത്തിനായി ഒരു പാച്ച് സമർപ്പിക്കുമ്പോൾ, ഡെവലപ്പർ പ്രതിബദ്ധത സന്ദേശത്തിൽ ഒരു സൈൻ-ഓഫ് സ്റ്റേറ്റ്മെന്റ് ഉൾപ്പെടുത്തണമെന്ന് ഞങ്ങൾ ആവശ്യപ്പെടുന്നു.

source: Here is an example Signed-off-by line, which indicates that the submitter accepts the DCO:
ml: സമർപ്പിച്ചയാൾ DCO സ്വീകരിക്കുന്നുവെന്ന് സൂചിപ്പിക്കുന്ന സൈൻ-ഓഫ്-ബൈ ലൈൻ ഒരു ഉദാഹരണം ഇതാ:

source: You can include this automatically when you commit a change to your local git repository using ``git commit -s``.
ml: `` Git commit -s`` ഉപയോഗിച്ച് നിങ്ങളുടെ പ്രാദേശിക ജിറ്റ് ശേഖരത്തിൽ മാറ്റം വരുത്തുമ്പോൾ ഇത് സ്വപ്രേരിതമായി ഉൾപ്പെടുത്താം.

source: Related Topics
ml: ബന്ധപ്പെട്ട വിഷയങ്ങൾ
